In [7]:
# 前三个Cell为基础函数, 之前都有, 直接复制第四个Cell的内容

In [17]:
import mysql.connector as db # Use library "mysql-connector-python"
import re
import numpy  as np
import pandas as pd
import math

In [18]:
class DBConnectionError(Exception):
    def __init__(self,n): 
        self.n=n

class SQLQueryError(Exception):
    def __init__(self,n): 
        self.n=n

In [22]:
# The basic function for database connection
# Do not use it directly

def mysql_connection(ip_port, user, passwd, schema):
# ip_port should be like this: ip:port
    ip_port_split = re.search("(.*):(\d*)", ip_port)
    ip   = ip_port_split[1]
    port = ip_port_split[2]
    
    
    try:
        connection = db.connect(host=ip, port=port,
                                user=user, passwd=passwd, 
                                db=schema) # specify the schema

        cursor = connection.cursor()
    except mysql.connector.Error as msg: 
        raise DBConnectionError(msg)
    return connection,cursor

In [28]:
def ranking_query_data(rank_type):
# input format
# type: world, league, all, fifa, uefa

    conn, cur = mysql_connection("192.168.56.102:6123", "root", "mysql", "football")
    
    if(len(rank_type)!=4):
    # use word length to judge whether is going to use our table or uefa / fifa table
        format_str="""
            SELECT NAME, points
            FROM {rank_type}_country
            ORDER BY points DESC;"""
        query = format_str.format(rank_type=rank_type)
    
    elif(rank_type=="fifa"):
        query="""
            SELECT TEAM, TOTAL_POINTS
            FROM std_fifa_ranking;"""
        
    else:
        query="""
            SELECT Country, Pts
            FROM std_uefa_ranking;"""
        
    print(query) # for debug
    
    try:
        cur.execute(query)
    except mysql.connector.ProgrammingError as msg:
        raise SQLQueryError(msg)
    
    try:
        results = cur.fetchall()
    except InterfaceError as msg:
        if(msg=="No result set to fetch from."): return None
    
    df_results = pd.DataFrame(results, columns=["Country","Points"])
    df_results.index.name = 'ranking' 
    return df_results

# display(ranking_query_data("world"))
# display(ranking_query_data("league"))
# display(ranking_query_data("all"))

# display(ranking_query_data("fifa"))
# display(ranking_query_data("uefa"))

            SELECT NAME, points
            FROM world_country
            ORDER BY points DESC;

               Country   Points
ranking
0               Brazil  1791.42
1               France  1784.10
2              Belgium  1758.81
3                Spain  1726.03
4              Germany  1682.22
...                ...      ...
307          Sri Lanka   727.87
308         East Timor   718.70
309      Liechtenstein   686.58
310            Andorra   618.31
311         San Marino   461.05

[312 rows x 2 columns]

            SELECT NAME, points
            FROM league_country
            ORDER BY points DESC;

                  Country   Points
ranking
0                 england  1726.07
1                   spain  1639.48
2             netherlands  1525.06
3                portugal  1482.28
4                 germany  1471.53
...                   ...      ...
206               estonia   807.08
207      northern-ireland   802.29
208         faroe-islands   748.19
209               andorra   523.03
210            san-marino   425.71

[211 rows x 2 columns]

            SELECT NAME, points
            FROM all_country
            ORDER BY points DESC;

             Country   Points
ranking
0            England  1836.67
1              Spain  1750.07
2        Netherlands  1636.08
3             Brazil  1628.14
4           Portugal  1593.16
...              ...      ...
354             Laos   713.79
355           Bhutan   690.01
356          Andorra   541.71
357       san-marino   505.00
358       San Marino   461.05

[359 rows x 2 columns]

            SELECT TEAM, TOTAL_POINTS
            FROM std_fifa_ranking;

                          Country   Points
ranking
0                         Belgium  1783.38
1                          France   1757.3
2                          Brazil  1742.65
3                         England  1686.78
4                        Portugal  1666.12
...                           ...      ...
205      Turks and Caicos Islands   843.65
206             US Virgin Islands   829.13
207        British Virgin Islands   826.27
208                      Anguilla   805.42
209                    San Marino   804.71

[210 rows x 2 columns]

            SELECT Country, Pts
            FROM std_uefa_ranking;

                        Country   Points
ranking
0                       England  100.140
1                         Spain   97.712
2                         Italy   75.438
3                       Germany   73.570
4                        France   56.081
5                      Portugal   48.549
6                   Netherlands   39.200
7                        Russia   38.382
8                       Belgium   36.500
9                       Austria   35.825
10                     Scotland   33.375
11                      Ukraine   33.100
12                       Turkey   30.100
13                      Denmark   27.875
14                       Cyprus   27.750
15                       Serbia   26.750
16               Czech Republic   26.600
17                      Croatia   26.275
18                  Switzerland   26.225
19                       Greece   26.000
20                       Israel   24.375
21                       Norway   21.000
22                       Sweden   20.500
23                     Bulgaria   20.375
24                      Romania   18.200
25                   Azerbaijan   16.875
26                   Kazakhstan   15.625
27                      Hungary   15.500
28                      Belarus   15.250
29                       Poland   15.125
30                     Slovenia   14.250
31                     Slovakia   13.625
32                Liechtenstein    9.000
33                    Lithuania    8.750
34                   Luxembourg    8.250
35       Bosnia and Herzegovina    8.000
36          Republic of Ireland    7.875
37              North Macedonia    7.625
38                      Armenia    7.375
39                       Latvia    7.375
40                      Albania    7.250
41             Northern Ireland    6.958
42                      Georgia    6.875
43                      Finland    6.875
44                      Moldova    6.875
45                        Malta    6.375
46                Faroe Islands    6.125
47                       Kosovo    5.833
48                    Gibraltar    5.666
49                   Montenegro    5.000
50                        Wales    5.000
51                      Iceland    4.875
52                      Estonia    4.750
53                      Andorra    3.331
54                   San Marino    1.166